In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("test_nan.csv")
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [3]:
columns = ["col1", "col2", "col3"]
data = [
    ["test1", 13, None],
    ["test2", 44, "aaa"],
    ["test3", None, None],
    [None, None, None]
]

df2 = pd.DataFrame(data=data, columns=columns)
df2

    col1  col2  col3
0  test1  13.0  None
1  test2  44.0   aaa
2  test3   NaN  None
3   None   NaN  None

In [5]:
type(df2.col3[0])

NoneType

In [6]:
type(df2.col2[3])

numpy.float64

In [7]:
data = [
    ["test1", 13, np.nan],
    ["test2", 44, "aaa"],
    ["test3", np.nan, np.nan],
    [np.nan, np.nan, np.nan]
]

df2 = pd.DataFrame(data=data, columns=columns)
df2

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN

In [8]:
df2.col3.isna()

0     True
1    False
2     True
3     True
Name: col3, dtype: bool

In [9]:
df2[df2.col3.isna()]

    col1  col2 col3
0  test1  13.0  NaN
2  test3   NaN  NaN
3    NaN   NaN  NaN

In [10]:
df2[df2.col3.notna()]

    col1  col2 col3
1  test2  44.0  aaa

In [11]:
df2[~(df2.col3.isna())]

    col1  col2 col3
1  test2  44.0  aaa

In [12]:
help(df2.col3.isna)

Help on method isna in module pandas.core.series:

isna() -> 'Series' method of pandas.core.series.Series instance
    Detect missing values.

    Return a boolean same-sized object indicating if the values are NA.
    NA values, such as None or :attr:`numpy.NaN`, gets mapped to True
    values.
    Everything else gets mapped to False values. Characters such as empty
    strings ``''`` or :attr:`numpy.inf` are not considered NA values
    (unless you set ``pandas.options.mode.use_inf_as_na = True``).

    Returns
    -------
    Series
        Mask of bool values for each element in Series that
        indicates whether an element is an NA value.

    See Also
    --------
    Series.isnull : Alias of isna.
    Series.notna : Boolean inverse of isna.
    Series.dropna : Omit axes labels with missing values.
    isna : Top-level isna.

    Examples
    --------
    Show which entries in a DataFrame are NA.

    >>> df = pd.DataFrame(dict(age=[5, 6, np.NaN],
    ...                    born=[pd.NaT, pd.Timestamp('1939-05-27'),
    ...                          pd.Timestamp('1940-04-25')],
    ...                    name=['Alfred', 'Batman', ''],
    ...                    toy=[None, 'Batmobile', 'Joker']))
    >>> df
       age       born    name        toy
    0  5.0        NaT  Alfred       None
    1  6.0 1939-05-27  Batman  Batmobile
    2  NaN 1940-04-25              Joker

    >>> df.isna()
         age   born   name    toy
    0  False   True  False   True
    1  False  False  False  False
    2   True  False  False  False

    Show which entries in a Series are NA.

    >>> ser = pd.Series([5, 6, np.NaN])
    >>> ser
    0    5.0
    1    6.0
    2    NaN
    dtype: float64

    >>> ser.isna()
    0    False
    1    False
    2     True
    dtype: bool

In [13]:
help(df2.col3.isnull)

Help on method isnull in module pandas.core.series:

isnull() -> 'Series' method of pandas.core.series.Series instance
    Series.isnull is an alias for Series.isna.

    Detect missing values.

    Return a boolean same-sized object indicating if the values are NA.
    NA values, such as None or :attr:`numpy.NaN`, gets mapped to True
    values.
    Everything else gets mapped to False values. Characters such as empty
    strings ``''`` or :attr:`numpy.inf` are not considered NA values
    (unless you set ``pandas.options.mode.use_inf_as_na = True``).

    Returns
    -------
    Series
        Mask of bool values for each element in Series that
        indicates whether an element is an NA value.

    See Also
    --------
    Series.isnull : Alias of isna.
    Series.notna : Boolean inverse of isna.
    Series.dropna : Omit axes labels with missing values.
    isna : Top-level isna.

    Examples
    --------
    Show which entries in a DataFrame are NA.

    >>> df = pd.DataFrame(dict(age=[5, 6, np.NaN],
    ...                    born=[pd.NaT, pd.Timestamp('1939-05-27'),
    ...                          pd.Timestamp('1940-04-25')],
    ...                    name=['Alfred', 'Batman', ''],
    ...                    toy=[None, 'Batmobile', 'Joker']))
    >>> df
       age       born    name        toy
    0  5.0        NaT  Alfred       None
    1  6.0 1939-05-27  Batman  Batmobile
    2  NaN 1940-04-25              Joker

    >>> df.isna()
         age   born   name    toy
    0  False   True  False   True
    1  False  False  False  False
    2   True  False  False  False

    Show which entries in a Series are NA.

    >>> ser = pd.Series([5, 6, np.NaN])
    >>> ser
    0    5.0
    1    6.0
    2    NaN
    dtype: float64

    >>> ser.isna()
    0    False
    1    False
    2     True
    dtype: bool